In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
pd.options.display.max_columns = 30

In [3]:
df = pd.read_csv('/Users/marco/Desktop/futuro/full.csv')

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,WikiId,Name_wiki,Age_wiki,Hometown,Boarded,Destination,Lifeboat,Body,Class
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,691.0,"Braund, Mr. Owen Harris",22.0,"Bridgerule, Devon, England",Southampton,"Qu'Appelle Valley, Saskatchewan, Canada",NaN,NaN,3.0
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,90.0,"Cumings, Mrs. Florence Briggs (née Thayer)",35.0,"New York, New York, US",Cherbourg,"New York, New York, US",4,NaN,1.0
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,865.0,"Heikkinen, Miss Laina",26.0,"Jyväskylä, Finland",Southampton,New York City,14?,NaN,3.0
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,127.0,"Futrelle, Mrs. Lily May (née Peel)",35.0,"Scituate, Massachusetts, US",Southampton,"Scituate, Massachusetts, US",D,NaN,1.0
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,627.0,"Allen, Mr. William Henry",35.0,"Birmingham, West Midlands, England",Southampton,New York City,NaN,NaN,3.0

In [5]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'WikiId', 'Name_wiki',
       'Age_wiki', 'Hometown', 'Boarded', 'Destination', 'Lifeboat', 'Body',
       'Class'],
      dtype='object')

In [6]:
df = df.drop(['WikiId', 'Name_wiki', 'Age_wiki', 'Cabin', 'Ticket', 'Body', 'Lifeboat', 'Class'], axis=1)

In [7]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Hometown,Boarded,Destination
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S,"Bridgerule, Devon, England",Southampton,"Qu'Appelle Valley, Saskatchewan, Canada"
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C,"New York, New York, US",Cherbourg,"New York, New York, US"
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S,"Jyväskylä, Finland",Southampton,New York City
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S,"Scituate, Massachusetts, US",Southampton,"Scituate, Massachusetts, US"
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S,"Birmingham, West Midlands, England",Southampton,New York City

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1309 non-null   int64
 1   Survived     891 non-null    float64
 2   Pclass       1309 non-null   int64
 3   Name         1309 non-null   object
 4   Sex          1309 non-null   object
 5   Age          1046 non-null   float64
 6   SibSp        1309 non-null   int64
 7   Parch        1309 non-null   int64
 8   Fare         1308 non-null   float64
 9   Embarked     1307 non-null   object
 10  Hometown     1304 non-null   object
 11  Boarded      1304 non-null   object
 12  Destination  1304 non-null   object
dtypes: float64(3), int64(4), object(6)
memory usage: 133.1+ KB

In [9]:
df.loc[df['Name'].str.contains('Astor', case=False)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Hometown,Boarded,Destination
700,701,1.0,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18.0,1,0,227.525,C,"New York, New York, US",Cherbourg,"New York, New York, US"
1093,1094,NaN,1,"Astor, Col. John Jacob",male,47.0,1,0,227.525,C,"New York, New York, US",Cherbourg,"New York, New York, US"

In [10]:
df.loc[1093, 'Survived']=0.0

In [11]:
df.loc[df['Name'].str.contains('Astor', case=False)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Hometown,Boarded,Destination
700,701,1.0,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18.0,1,0,227.525,C,"New York, New York, US",Cherbourg,"New York, New York, US"
1093,1094,0.0,1,"Astor, Col. John Jacob",male,47.0,1,0,227.525,C,"New York, New York, US",Cherbourg,"New York, New York, US"

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1309 non-null   int64
 1   Survived     892 non-null    float64
 2   Pclass       1309 non-null   int64
 3   Name         1309 non-null   object
 4   Sex          1309 non-null   object
 5   Age          1046 non-null   float64
 6   SibSp        1309 non-null   int64
 7   Parch        1309 non-null   int64
 8   Fare         1308 non-null   float64
 9   Embarked     1307 non-null   object
 10  Hometown     1304 non-null   object
 11  Boarded      1304 non-null   object
 12  Destination  1304 non-null   object
dtypes: float64(3), int64(4), object(6)
memory usage: 133.1+ KB

In [13]:
df.loc[df['Hometown'].isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Hometown,Boarded,Destination
347,348,1.0,3,"Davison, Mrs. Thomas Henry (Mary E Finck)",female,NaN,1,0,16.1000,S,NaN,NaN,NaN
557,558,0.0,1,"Robbins, Mr. Victor",male,NaN,0,0,227.5250,C,NaN,NaN,NaN
1041,1042,NaN,1,"Earnshaw, Mrs. Boulton (Olive Potter)",female,23.0,0,1,83.1583,C,NaN,NaN,NaN
1048,1049,NaN,3,"Lundin, Miss. Olga Elida",female,23.0,0,0,7.8542,S,NaN,NaN,NaN
1228,1229,NaN,3,"Elias, Mr. Joseph",male,39.0,0,2,7.2292,C,NaN,NaN,NaN

In [14]:
df.loc[df['Name'].str.contains('Davison', case=False)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Hometown,Boarded,Destination
347,348,1.0,3,"Davison, Mrs. Thomas Henry (Mary E Finck)",female,NaN,1,0,16.1,S,NaN,NaN,NaN
949,950,NaN,3,"Davison, Mr. Thomas Henry",male,NaN,1,0,16.1,S,"Liverpool, Merseyside, England",Southampton,"Bedford, Indiana, US"

In [15]:
df.loc[347,'Boarded']=df.loc[949,'Boarded']

In [16]:
df.loc[347,'Destination']=df.loc[949,'Destination']

In [17]:
df.loc[949,'Survived']=0.0

In [18]:
df.loc[df['Boarded'].isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Hometown,Boarded,Destination
557,558,0.0,1,"Robbins, Mr. Victor",male,NaN,0,0,227.5250,C,NaN,NaN,NaN
1041,1042,NaN,1,"Earnshaw, Mrs. Boulton (Olive Potter)",female,23.0,0,1,83.1583,C,NaN,NaN,NaN
1048,1049,NaN,3,"Lundin, Miss. Olga Elida",female,23.0,0,0,7.8542,S,NaN,NaN,NaN
1228,1229,NaN,3,"Elias, Mr. Joseph",male,39.0,0,2,7.2292,C,NaN,NaN,NaN

In [19]:
df.loc[1048,'Boarded']='Southampton'

In [20]:
df.loc[557,'Boarded']='Cherbourg'

In [21]:
df.loc[1041,'Boarded']='Cherbourg'

In [22]:
df.loc[1228,'Boarded']='Cherbourg'

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1309 non-null   int64
 1   Survived     893 non-null    float64
 2   Pclass       1309 non-null   int64
 3   Name         1309 non-null   object
 4   Sex          1309 non-null   object
 5   Age          1046 non-null   float64
 6   SibSp        1309 non-null   int64
 7   Parch        1309 non-null   int64
 8   Fare         1308 non-null   float64
 9   Embarked     1307 non-null   object
 10  Hometown     1304 non-null   object
 11  Boarded      1309 non-null   object
 12  Destination  1305 non-null   object
dtypes: float64(3), int64(4), object(6)
memory usage: 133.1+ KB

In [24]:
df.loc[df['Embarked'].isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Hometown,Boarded,Destination
61,62,1.0,1,"Icard, Miss. Amelie",female,38.0,0,0,80.0,NaN,"New York, New York, US",Southampton,"New York, New York, US"
829,830,1.0,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,80.0,NaN,"New York, New York, US",Southampton,"New York, New York, US"

In [25]:
df.loc[61,'Embarked']='S'

In [26]:
df.loc[829,'Embarked']='S'

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1309 non-null   int64
 1   Survived     893 non-null    float64
 2   Pclass       1309 non-null   int64
 3   Name         1309 non-null   object
 4   Sex          1309 non-null   object
 5   Age          1046 non-null   float64
 6   SibSp        1309 non-null   int64
 7   Parch        1309 non-null   int64
 8   Fare         1308 non-null   float64
 9   Embarked     1309 non-null   object
 10  Hometown     1304 non-null   object
 11  Boarded      1309 non-null   object
 12  Destination  1305 non-null   object
dtypes: float64(3), int64(4), object(6)
memory usage: 133.1+ KB

In [28]:
df.drop(df[df['Survived'].isnull()].index, inplace = True)

In [29]:
df['Survived']=df['Survived'].astype(int)

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 893 entries, 0 to 1093
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  893 non-null    int64
 1   Survived     893 non-null    int64
 2   Pclass       893 non-null    int64
 3   Name         893 non-null    object
 4   Sex          893 non-null    object
 5   Age          715 non-null    float64
 6   SibSp        893 non-null    int64
 7   Parch        893 non-null    int64
 8   Fare         893 non-null    float64
 9   Embarked     893 non-null    object
 10  Hometown     891 non-null    object
 11  Boarded      893 non-null    object
 12  Destination  892 non-null    object
dtypes: float64(2), int64(5), object(6)
memory usage: 97.7+ KB

In [31]:
df[df['Age'].isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Hometown,Boarded,Destination
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,8.4583,Q,"Cork, Ireland",Queenstown,New York City
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,13.0000,S,"Harrow, London, England",Southampton,"Chicago, Illinois, US"
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,7.2250,C,"Tebnine, Lebanon",Cherbourg,"Michigan City, Indiana, US"
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,7.2250,C,"Hadath, Lebanon",Cherbourg,New York City
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,7.8792,Q,"Limerick, Limerick, Ireland",Queenstown,New York City
...,...,...,...,...,...,...,...,...,...,...,...,...,...
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,69.5500,S,"Peterborough, Cambridgeshire, England",Southampton,"Jacksonville, Florida, US"
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,9.5000,S,"Haaltert, East Flanders, Belgium",Southampton,"Detroit, Michigan, US"
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,7.8958,S,"Knezhni Lak, Troyan, Bulgaria",Southampton,"Chicago, Illinois, US"
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,23.4500,S,"Thornton Heath, London, England",Southampton,"New London, Connecticut, US"
949,950,0,3,"Davison, Mr. Thomas Henry",male,NaN,1,0,16.1000,S,"Liverpool, Merseyside, England",Southampton,"Bedford, Indiana, US"

In [32]:
df[df['Sex']=='male']['Age'].mean()

30.762488986784142

In [33]:
df[df['Sex']=='female']['Age'].mean()

27.915708812260537

In [34]:
idx = df[(df['Sex'] == 'male') & df['Age'].isnull()]['Age'].index

In [35]:
df.loc[idx, 'Age'] = 30.73

In [36]:
idx = df[(df['Sex'] == 'female') & df['Age'].isnull()]['Age'].index

In [37]:
df.loc[idx, 'Age'] = 27.92

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 893 entries, 0 to 1093
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  893 non-null    int64
 1   Survived     893 non-null    int64
 2   Pclass       893 non-null    int64
 3   Name         893 non-null    object
 4   Sex          893 non-null    object
 5   Age          893 non-null    float64
 6   SibSp        893 non-null    int64
 7   Parch        893 non-null    int64
 8   Fare         893 non-null    float64
 9   Embarked     893 non-null    object
 10  Hometown     891 non-null    object
 11  Boarded      893 non-null    object
 12  Destination  892 non-null    object
dtypes: float64(2), int64(5), object(6)
memory usage: 130.0+ KB

In [39]:
df.to_csv('/Users/marco/Desktop/futuro/full.csv')